Catalogs/ЗамещающиеАгенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ЗамещающиеАгенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cas_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>first_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>last_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>patronymic</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЗамещающиеАгенты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСпрвочник(Команда)
	
	Ошибки = "";	
	ДанныеОбАгентах = ЗаявкиНаКредитRestAPI.ПолучитьДоступныхАгентов(ПараметрыAPI, , , , Ошибки);
	Если Ошибки = "" Тогда
		ЗаполнитьЗамещающихАгентов(ДанныеОбАгентах);			
	Иначе
		Сообщить("Ошибка при получении данных об агентах: " + Ошибки);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗамещающихАгентов(ДанныеОбАгентах) 
	
	Для каждого Агент Из ДанныеОбАгентах Цикл
		Если НЕ ЗначениеЗаполнено(Справочники.ЗамещающиеАгенты.НайтиПоРеквизиту("email", СокрЛП(Агент.email))) И Найти(СокрЛП(Агент.email), "sberbank") Тогда //sberbank
			Попытка
				НовыйЭлемент = Справочники.ЗамещающиеАгенты.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, Агент);
				НовыйЭлемент.РасширенноеРедактирование = Истина;
				НовыйЭлемент.Записать();
			Исключение
				Сообщить("Ошибка создания агента: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//test
	ПараметрыAPI = Справочники.ПараметрыПодключенияAPIИпотечныхБанков.НайтиПоНаименованию("Парлайн", Истина);
	
КонецПроцедуры
